In [5]:
import pandas as pd
data = {'a':[1,2,3,4,5],
        'b':[123,35,52,243,645],
        'c':['vk','pp','dp','ss','ak']
}

In [8]:
df = pd.DataFrame(data,index=['i','ii','iii','iv','v'])

In [9]:
df

     a    b   c
i    1  123  vk
ii   2   35  pp
iii  3   52  dp
iv   4  243  ss
v    5  645  ak

In [12]:
df.reindex(['iii','v','ii','iv','i']) #it is used to re-arrange rows like however we want to

     a    b   c
iii  3   52  dp
v    5  645  ak
ii   2   35  pp
iv   4  243  ss
i    1  123  vk

In [14]:
for i in df.iterrows(): #it givers rows per iteration
    print(i)

('i', a      1
b    123
c     vk
Name: i, dtype: object)
('ii', a     2
b    35
c    pp
Name: ii, dtype: object)
('iii', a     3
b    52
c    dp
Name: iii, dtype: object)
('iv', a      4
b    243
c     ss
Name: iv, dtype: object)
('v', a      5
b    645
c     ak
Name: v, dtype: object)

In [15]:
for i in df.iteritems(): #it gives entire columns per iteration
    print(i)

('a', i      1
ii     2
iii    3
iv     4
v      5
Name: a, dtype: int64)
('b', i      123
ii      35
iii     52
iv     243
v      645
Name: b, dtype: int64)
('c', i      vk
ii     pp
iii    dp
iv     ss
v      ak
Name: c, dtype: object)

/tmp/ipykernel_118/3637252818.py:1: FutureWarning: iteritems is deprecated and will be removed in a future version. Use .items instead.
  for i in df.iteritems(): #it gives entire columns per iteration

In [16]:
list(df['a'])

[1, 2, 3, 4, 5]

In [17]:
[i for i in df['a']]

[1, 2, 3, 4, 5]

In [19]:
def test(s):
    return s.sum()
df.apply(test)

a            15
b          1098
c    vkppdpssak
dtype: object

In [21]:
df1 = df[['a','b']]

In [22]:
df1

     a    b
i    1  123
ii   2   35
iii  3   52
iv   4  243
v    5  645

In [23]:
df1.applymap(lambda a:a**2)

      a       b
i     1   15129
ii    4    1225
iii   9    2704
iv   16   59049
v    25  416025

In [24]:
df

     a    b   c
i    1  123  vk
ii   2   35  pp
iii  3   52  dp
iv   4  243  ss
v    5  645  ak

In [26]:
df.sort_values('b')

     a    b   c
ii   2   35  pp
iii  3   52  dp
i    1  123  vk
iv   4  243  ss
v    5  645  ak

In [27]:
df.sort_index(ascending=False)

     a    b   c
v    5  645  ak
iv   4  243  ss
iii  3   52  dp
ii   2   35  pp
i    1  123  vk

In [29]:
df2 = pd.DataFrame({'data':["Data Science Masters course is highly curated and uniquely designed according to the latest industry standards. This program instills students the skills essential to knowledge discovery efforts to identify standard, novel, and truly differentiated solutions and decision-making, including skills in managing, querying, analyzing, visualizing, and extracting meaning from extremely large data sets. This trending program provides students with the statistical, mathematical and computational skills needed to meet the large-scale data science challenges of today's professional world. You will learn all the stack required to work in data science industry including cloud infrastructure and real-time industry projects. This course will be taught in Hindi language."]})

In [31]:
df2 #here you can see that the output does not show the whole data

                                                data
0  Data Science Masters course is highly curated ...

In [35]:
pd.set_option("display.max_colwidth",500)
df2

                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                  data
0  Data Science Masters course is highly curated and uniquely designed according to the latest industry standards. This program instills students the skills essential to knowledge discovery efforts to identify standard, novel, and truly differentiated solutions and decision-making, including skills in managing, querying, analyzing, visualizing, and extracting meaning from extremely large data sets. This trending program provides students with the statistical, mathematical and computational skil...